IDEA StatiCa Open Model
ConnectionSetup.LimitDeformationCheck Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Limit deformation on closed sections check or not
 Namespace: IdeaRS.OpenModel
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public bool LimitDeformationCheck { get; set; }
Public Property LimitDeformationCheck As Boolean
	Get
	Set
public:
property bool LimitDeformationCheck {
	bool get ();
	void set (bool value);
}
Property Value
Type: Boolean
See Also
Reference
ConnectionSetup Class
IdeaRS.OpenModel Namespace